import {
  mobile,
  backend,
  creator,
  web,
  javascript,
  typescript,
  html,
  css,
  reactjs,
  redux,
  tailwind,
  nodejs,
  mongodb,
  git,
  figma,
  docker,
  meta,
  starbucks,
  tesla,
  shopify,
  carrent,
  jobit,
  tripguide,
  threejs,
} from "../assets"


export const navLinks = [
  {
    id: "about",
    title: "За нас",
  },
  {
    id: "work",
    title: "Екип",
  },
  {
    id: "projects",
    title: "Проекти",
  },
  {
    id: "contact",
    title: "Връзка с нас",
  },

];

const services = [
  {
    title: "Безопасност",
    icon: web,
  },
  {
    title: "Качество",
    icon: mobile,
  },
  {
    title: "Креативност",
    icon: backend,
  },
  {
    title: "Опит",
    icon: creator,
  },
];

const technologies = [
  {
    name: "HTML 5",
    icon: html,
  },
  {
    name: "CSS 3",
    icon: css,
  },
  {
    name: "JavaScript",
    icon: javascript,
  },
  {
    name: "TypeScript",
    icon: typescript,
  },
  {
    name: "React JS",
    icon: reactjs,
  },
  {
    name: "Redux Toolkit",
    icon: redux,
  },
  {
    name: "Tailwind CSS",
    icon: tailwind,
  },
  {
    name: "Node JS",
    icon: nodejs,
  },
  {
    name: "MongoDB",
    icon: mongodb,
  },
  {
    name: "Three JS",
    icon: threejs,
  },
  {
    name: "git",
    icon: git,
  },
  {
    name: "figma",
    icon: figma,
  },
  {
    name: "docker",
    icon: docker,
  },
];

const experiences = [
  {
    title: "Владо",
    company_name: "Мениджър и собственик на СимоНик ООД",
    icon: starbucks,
    iconBg: "#383E56",
    points: [
      "Сътрудничество с архитекти, инженери и подизпълнители за създаване на график на проекта, поставяне на милници и осигуряване, че работата напредва ефективно.",
      "Увереността в качеството на строителната работа и спазването на стандартите за безопасност са от съществено значение за Владо. Те въвеждат мерки за контрол на качеството, за да наблюдават изработката и строителните процеси.",
      "Владо играе важна роля в поддържането на здрави отношения с клиентите. Той редовно се общува с клиентите, разглежда техните опасения и ги информира за напредъка на проекта.",
    ],
  },
  {
    title: "Иво",
    company_name: "Надзирател на строителни дейности",
    icon: tesla,
    iconBg: "#E6DEDD",
    points: [
      "Управление на всички строителни дейности на място. Това включва надзор и координация на работата на строителните екипи, подизпълнители и доставчици, за да се осигури ефективно изпълнение на задачите.",
      "Той трябва редовно да инспектира строителния обект, за да идентифицира възможни проблеми или дефекти и да предприеме подходящи мерки за поддържане на най-високите стандарти за изработка и безопасност.",
      "Ефективната комуникация е от съществено значение за строителните проекти. Надзирателят на място трябва да поддържа връзка с мениджърите на проекта, инженерите и другите заинтересовани стани, за да предоставя редовни актуализации относно напредъка на проекта и да докладва за дейностите на място.",
      
    ],
  },
  {
    title: "Ани",
    company_name: "Интериорен дизайнер",
    icon: shopify,
    iconBg: "#383E56",
    points: [
      "Тя анализира наличното пространство и създава ефективни планове на етажите, които оптимизират използването на пространството, като се вземат предвид нуждите и предпочитанията на клиента.",
      "Сътрудничи с различни професионалисти, включително архитекти, изпълнители и доставчици, за да осъществи дизайна. Тя тясно работи с тези страни, за да се гарантира, че дизайнът се изпълнява по план.",
      "Избира подходящи материали, мебели и декоративни елементи за проекта. Ани взема под внимание фактори като издръжливост, устойчивост и ограничения на бюджета.",
    ],
  },
  {
    title: "Test1",
    company_name: "Ex",
    icon: shopify,
    iconBg: "#383E56",
    points: [
      "Тя анализира наличното пространство и създава ефективни планове на етажите, които оптимизират използването на пространството, като се вземат предвид нуждите и предпочитанията на клиента.",
      "Сътрудничи с различни професионалисти, включително архитекти, изпълнители и доставчици, за да осъществи дизайна. Тя тясно работи с тези страни, за да се гарантира, че дизайнът се изпълнява по план.",
      "Избира подходящи материали, мебели и декоративни елементи за проекта. Ани взема под внимание фактори като издръжливост, устойчивост и ограничения на бюджета.",
    ],
  },
  {
    title: "Test2",
    company_name: "Ex2",
    icon: shopify,
    iconBg: "#383E56",
    points: [
      "Тя анализира наличното пространство и създава ефективни планове на етажите, които оптимизират използването на пространството, като се вземат предвид нуждите и предпочитанията на клиента.",
      "Сътрудничи с различни професионалисти, включително архитекти, изпълнители и доставчици, за да осъществи дизайна. Тя тясно работи с тези страни, за да се гарантира, че дизайнът се изпълнява по план.",
      "Избира подходящи материали, мебели и декоративни елементи за проекта. Ани взема под внимание фактори като издръжливост, устойчивост и ограничения на бюджета.",
    ],
  },
  {
    title: "Test3",
    company_name: "Ex3",
    icon: shopify,
    iconBg: "#383E56",
    points: [
      "Тя анализира наличното пространство и създава ефективни планове на етажите, които оптимизират използването на пространството, като се вземат предвид нуждите и предпочитанията на клиента.",
      "Сътрудничи с различни професионалисти, включително архитекти, изпълнители и доставчици, за да осъществи дизайна. Тя тясно работи с тези страни, за да се гарантира, че дизайнът се изпълнява по план.",
      "Избира подходящи материали, мебели и декоративни елементи за проекта. Ани взема под внимание фактори като издръжливост, устойчивост и ограничения на бюджета.",
    ],
  },
];

const testimonials = [
  {
    testimonial:
      "Работата със СимоНик беше лекота! Тяхното внимание към детайлите и своевременното изпълнение надминаха нашите очаквания!",
    name: "Сара Лий",
    designation: "Главен финансов офицер",
    company: "Opticlasa",
    image: "https://randomuser.me/api/portraits/women/4.jpg",
  },
  {
    testimonial:
      "СимоНик преобразува клиниката ни в модерно, функционално работно място благодарение на иновативните им дизайнерски решения.",
    name: "Крис Браун",
    designation: "Главен оперативен офицер",
    company: "dentahouse",
    image: "https://randomuser.me/api/portraits/men/5.jpg",
  },
  {
    testimonial:
      "От самото начало до завършването на проекта, СимоНик прояви професионализъм, който ни увери в техните способности.",
    name: "Лиза Уанг",
    designation: "Главен технологичен офицер",
    company: "Asics",
    image: "https://randomuser.me/api/portraits/women/6.jpg",
  },
];

const projects = [
  {
    name: "denta house",
    description:
      "един от нашите най-големи проекти, а именно стоматологичната клиника Denta house, изработена със стил и вкус, както винаги",
    tags: [
      {
        name: "dentahouse",
        color: "pink-text-gradient",
      },
    ],
    image: carrent,
  },
  {
    name: "Opticlasa",
    description:
      "Новият център на Opticlasa отвори врати и с гордост можем да кажем, че магазинът е един от нашите редовни клиенти!",
    tags: [
      {
        name: "opticlasa",
        color: "blue-text-gradient",
      },
    ],
    image: jobit,
  },
  {
    name: "Showroom Asics",
    description:
      "Известният шоурум на asics, направен много модерно и със стил, от умелния екип на СимоНик",
    tags: [
      {
        name: "asics",
        color: "green-text-gradient",
      },
    ],
    image: tripguide,
  },
  {
    name: "Test1",
    description:
      "Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the",
    tags: [
      {
        name: "test",
        color: "pink-text-gradient",
      },
    ],
    image: carrent,
  },
  {
    name: "Test2",
    description:
      "Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the",
    tags: [
      {
        name: "test",
        color: "pink-text-gradient",
      },
    ],
    image: carrent,
  },
  {
    name: "Test3",
    description:
      "Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the",
    tags: [
      {
        name: "test",
        color: "pink-text-gradient",
      },
    ],
    image: carrent,
  },
  
];

export { services, technologies, experiences, testimonials, projects };
